driver-tests/jmsbc/OndemandRead/JMSOndemand/src/triggerJMSC.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="triggerJMSC" targetNamespace="http://j2ee.netbeans.org/wsdl/JMSOndemand/triggerJMSC"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/JMSOndemand/triggerJMSC" xmlns:ns="http://xml.netbeans.org/schema/xxx" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/JMSOndemand/triggerJMSC">
            <xsd:import namespace="http://xml.netbeans.org/schema/xxx" schemaLocation="xxx.xsd"/>
        </xsd:schema>
    </types>
    <message name="triggerJMSCOperationRequest">
        <part name="part1" type="ns:x"/>
    </message>
    <message name="triggerJMSCOperationResponse">
        <part name="part1" type="ns:x"/>
    </message>
    <portType name="triggerJMSCPortType">
        <operation name="triggerJMSCOperation">
            <input name="input1" message="tns:triggerJMSCOperationRequest"/>
            <output name="output1" message="tns:triggerJMSCOperationResponse"/>
        </operation>
    </portType>
    <binding name="triggerJMSCBinding" type="tns:triggerJMSCPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="triggerJMSCOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/JMSOndemand/triggerJMSC"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/JMSOndemand/triggerJMSC"/>
            </output>
        </operation>
    </binding>
    <service name="triggerJMSCService">
        <port name="triggerJMSCPort" binding="tns:triggerJMSCBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/triggerJMSCService/triggerJMSCPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="triggerJMSC">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="triggerJMSCPortTypeRole" portType="tns:triggerJMSCPortType"/>
    </plnk:partnerLinkType>
</definitions>
