driver-tests/jmsbc/OndemandRead/JMSOndemandCA/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trig="http://j2ee.netbeans.org/wsdl/JMSOndemand/triggerJMSC" xmlns:xxx="http://xml.netbeans.org/schema/xxx">
  <soapenv:Body>
    <trig:triggerJMSCOperation>
      <part1>
        <xxx:y>?string?</xxx:y>
        <xxx:z>?string?</xxx:z>
      </part1>
    </trig:triggerJMSCOperation>
  </soapenv:Body>
</soapenv:Envelope>